---
title: راهمای نصب نسخه ۸ هیدیفای منیجر
---

### راهنمای نصب نسخه ۸ هیدیفای‌منیجر

برای نصب نسخه ۸ هیدیفای‌منیجر، رعایت نکات زیر ضروری است:

---

#### **پیش‌نیازها**
۱. **سرور خام:**
   - سرور باید کاملاً خام باشد و هیچ نسخه دیگری از پنل یا اسکریپت جانبی روی آن نصب نباشد.

۲. **نسخه لینوکس:**
   - سیستم‌عامل سرور باید **Ubuntu 22.04** باشد.

---

#### **مراحل نصب**

برای نصب نسخه ۸، دستورات زیر را به ترتیب اجرا کنید:

۱. **نصب pip:**
   ```bash
   pip install python-pip
   ```
   - **توضیحات:** این دستور برای نصب مدیریت پکیج‌های پایتون (pip) است که برای اجرای دستورات بعدی به آن نیاز داریم. معمولاً این ابزار روی بسیاری از سرورها از پیش نصب نشده است.

۲. **نصب کتابخانه تلگرام:**
   ```bash
   pip install pyTelegramBotAPI==4.22.0
   ```
   - **توضیحات:** این دستور برای نصب نسخه مشخصی از کتابخانه **pyTelegramBotAPI** است. نسخه ۸ هیدیفای‌منیجر تنها با این نسخه (۴.۲۲.۰) سازگار است.

۳. **نصب نسخه ۸ هیدیفای‌منیجر:**
   ```bash
   bash <(curl i.hiddify.com/v8.99.0)
   ```
   - **توضیحات:** این دستور آخرین نسخه از ورژن ۸ هیدیفای‌منیجر را نصب می‌کند. همچنین دیتابیس مربوطه را شناسایی و به‌درستی پیکربندی می‌کند.

---

#### **نکات مهم**
- قبل از اجرای دستورات، مطمئن شوید که سرور هیچ‌گونه تداخلی با نسخه‌های دیگر ندارد.
- برای جلوگیری از بروز خطا، مراحل را به ترتیب و با دقت انجام دهید.

---

با رعایت این راهنما، نسخه ۸ هیدیفای‌منیجر به‌درستی روی سرور شما نصب خواهد شد.

